app/controllers/admin/dashboard_controller.rb

SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
---
  def show
    @products = Product.all
    @categories = Category.all