app/views/layouts/_top_nav.html.erb

SELECT "categories".* FROM "categories"
---
          <ul class="dropdown-menu dropdown-menu-dark" aria-labelledby="navbarDropdown"> %>
            <% Category.all.each do |category| %>